#### Terraform Validation & Plan Results
* Terraform Version 📎`1.14.3`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.communication_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/voi-aig-dev-uai001][0m
[0m[1mmodule.communication_service.azurerm_communication_service.communication_service: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mmodule.ai_service.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppEnvironmentSubnet][0m
[0m[1mmodule.ai_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/276acc93-729b-9c60-3859-c63cb268f835][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae79b26e-925e-2c19-1537-44231d416c86][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_secrets_officer: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001/providers/Microsoft.Authorization/roleAssignments/6414a717-a4e8-dac1-997c-817a4d9adc98][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.KeyVault/vaults/voi-aig-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Reading...[0m[0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ConAppPrivateEndpointSubnet][0m
[0m[1mmodule.communication_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_communication_service: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001][0m
[0m[1mmodule.communication_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_communication_service["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001|applicationLogs-0][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-kv001-vault-pe][0m
[0m[1mmodule.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Network/privateEndpoints/voi-aig-dev-ai001-account-pe][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:39Z][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_communication_service_primary_connection_string: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/acs-connection-string/7e32ac70e15a4887868a51b1e13392e9][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_aoai_primary_access_key: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/aoai-primary-access-key/73ca097d844b42fab851584b7aad7708][0m
[0m[1mmodule.ai_service.time_sleep.sleep_connectivity: Refreshing state... [id=2025-11-07T08:02:52Z][0m
[0m[1mazurerm_cognitive_account_rai_policy.cognitive_account_rai_policy: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/raiPolicies/default][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_40_transcribe: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/deployments/gpt-4o-transcribe][0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_realtime: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001/deployments/gpt-realtime][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_application_insights_connection_string: Refreshing state... [id=https://voi-aig-dev-kv001.vault.azure.net/secrets/ai-connection-string/61f11ffbd49648a79e1037c0833f9ba6][0m
[0m[1mazurerm_container_app_environment.container_app_environment: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001][0m
[0m[1mmodule.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Insights/components/voi-aig-dev-appi001|applicationLogs-0][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_app_environment: Reading...[0m[0m
[0m[1mazurerm_container_app.container_app_backend: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/containerApps/voi-aig-dev-ca001-backend][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_app_environment: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_container_app_environment["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.App/managedEnvironments/voi-aig-dev-cae001|applicationLogs-0][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # azurerm_eventgrid_system_topic.eventgrid_system_topic[0m will be created
[0m  [32m+[0m[0m resource "azurerm_eventgrid_system_topic" "eventgrid_system_topic" {
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m location               = "global"
      [32m+[0m[0m metric_arm_resource_id = (known after apply)
      [32m+[0m[0m metric_resource_id     = (known after apply)
      [32m+[0m[0m name                   = "voi-aig-dev-acs001-egst001"
      [32m+[0m[0m resource_group_name    = "voi-aig-dev-rg"
      [32m+[0m[0m source_arm_resource_id = (known after apply)
      [32m+[0m[0m source_resource_id     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.Communication/communicationServices/voi-aig-dev-acs001"
      [32m+[0m[0m topic_type             = "Microsoft.Communication.CommunicationServices"
    }

[1m  # azurerm_eventgrid_system_topic_event_subscription.eventgrid_system_topic_event_subscription[0m will be created
[0m  [32m+[0m[0m resource "azurerm_eventgrid_system_topic_event_subscription" "eventgrid_system_topic_event_subscription" {
      [32m+[0m[0m advanced_filtering_on_arrays_enabled = true
      [32m+[0m[0m event_delivery_schema                = "EventGridSchema"
      [32m+[0m[0m eventhub_endpoint_id                 = (known after apply)
      [32m+[0m[0m hybrid_connection_endpoint_id        = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m included_event_types                 = [
          [32m+[0m[0m "Microsoft.Communication.IncomingCall",
        ]
      [32m+[0m[0m labels                               = []
      [32m+[0m[0m name                                 = "event-subscription-phonecall"
      [32m+[0m[0m resource_group_name                  = "voi-aig-dev-rg"
      [32m+[0m[0m system_topic                         = "voi-aig-dev-acs001-egst001"

      [32m+[0m[0m retry_policy {
          [32m+[0m[0m event_time_to_live    = 1440
          [32m+[0m[0m max_delivery_attempts = 30
        }

      [32m+[0m[0m webhook_endpoint {
          [32m+[0m[0m base_url                          = (known after apply)
          [32m+[0m[0m max_events_per_batch              = 1
          [32m+[0m[0m preferred_batch_size_in_kilobytes = 64
          [32m+[0m[0m url                               = "https://greensea-4b4c6f65.northeurope.azurecontainerapps.io/v1/calls/incoming"
        }
    }

[1m  # module.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001"
    }

[1m  # module.ai_service.azurerm_cognitive_account.cognitive_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_cognitive_account" "cognitive_account" {
        id                                          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001"
        name                                        = "voi-aig-dev-ai001"
        tags                                        = {
            "workload" = "voice-agent"
        }
        [90m# (20 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [31m-[0m[0m bypass         = "AzureServices" [90m-> null[0m[0m
          [33m~[0m[0m default_action = "Allow" [33m->[0m[0m "Deny"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.ai_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_account" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/voi-aig-dev-rg/providers/Microsoft.CognitiveServices/accounts/voi-aig-dev-ai001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "Audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m [0m2 to add, 2 to change, 0 to destroy.
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"],
[33m│[0m [0m  on .terraform/modules/application_insights/modules/applicationinsights/diagnostics.tf line 1, in resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights":
[33m│[0m [0m   1: resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m`metric` has been deprecated in favor of the `enabled_metric` property and
[33m│[0m [0mwill be removed in v5.0 of the AzureRM provider
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>